shift_tasks = [
    {
        "СтатусЗакрытия": False,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 2345",
        "РабочийЦентр": "Какой-то РабочийЦентр",
        "Линия": "Т2",
        "Смена": "1",
        "Бригада": "Бригада №4",
        "НомерПартии": 22222,
        "ДатаПартии": "2024-01-30",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    },
    {
        "СтатусЗакрытия": True,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 1234",
        "РабочийЦентр": "Какой-то РабочийЦентр",
        "Линия": "Т3",
        "Смена": "2",
        "Бригада": "Бригада №2",
        "НомерПартии": 11111,
        "ДатаПартии": "2024-01-30",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    },
    {
        "СтатусЗакрытия": True,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 5678",
        "РабочийЦентр": "Какой-то РабочийЦентр",
        "Линия": "Т2",
        "Смена": "1",
        "Бригада": "Бригада №62",
        "НомерПартии": 45212,
        "ДатаПартии": "2024-01-30",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    },
]

unique_product_identifiers = [
    {
        "УникальныйКодПродукта": "12gRV60MMsn1",
        "НомерПартии": 22222,
        "ДатаПартии": "2024-01-30"
    },
    {
        "УникальныйКодПродукта": "12gRV60MMsn2",
        "НомерПартии": 11111,
        "ДатаПартии": "2024-01-30"
    }
]
